# parameters
nc: 1  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple

# anchors
anchors: 3



# repvgg backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, RepVGGBlock, [40, 3, 2]],  # 0-P1/2
   [-1, 1, RepVGGBlock, [48, 3, 2]], # 1-P2/4
   [-1, 1, RepVGGBlock, [40, 3, 1]], # 2-P2/4
   [-1, 1, RepVGGBlock, [96, 3, 2]], # 3-P3/8
   [-1, 1, RepVGGBlock, [80, 3, 1]], #4
   [-1, 1, RepVGGBlock, [80, 3, 1]], #5
   [-1, 1, RepVGGBlock, [80, 3, 1]], # cat 4
   [-1, 1, RepVGGBlock, [192, 3, 2]], # 5-P4/16
   [-1, 1, RepVGGBlock, [176, 3, 1]], #8
   [-1, 1, RepVGGBlock, [176, 3, 1]],
   [-1, 1, RepVGGBlock, [176, 3, 1]], # CAT 6
   [-1, 1, RepVGGBlock, [512, 3, 2]], #11 7-P4/16
  ]
# YOLOv5 head
head:
  [[-1, 1, GSConv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 10], 1, Concat, [1]],  # cat backbone P4
   [-1, 2, C2fCA, [256, False]],  # 15

   [-1, 1, GSConv, [128, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],  # cat backbone P3
   [-1, 2, C2fCA, [128, False]],  # 19 (P3/8-small)

   [-1, 1, GSConv, [128, 3, 2]],
   [[-1, 16, 7], 1, Concat, [1]],  # cat head P4
   [-1, 2, C2fCA, [128, False]],  # 22 (P4/16-medium)

   [-1, 1, GSConv, [256, 3, 2]],
   [[-1, 12], 1, Concat, [1]],  # cat head P5
   [-1, 2, C2fCA, [512, False]],  # 25 (P5/32-large)

   [[19, 22, 25], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
