# parameters
nc: 1  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple

# anchors
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# repvgg backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, RepVGGBlock, [40, 3, 2]],  # 0-P1/2
   [-1, 1, RepVGGBlock, [48, 3, 2]], # 1-P2/4
   [-1, 1, RepVGGBlock, [40, 3, 1]], # 2-P2/4
   [-1, 1, RepVGGBlock, [96, 3, 2]], # 3-P3/8
   [-1, 1, RepVGGBlock, [80, 3, 1]], #4
   [-1, 1, RepVGGBlock, [80, 3, 1]], #5
   [-1, 1, RepVGGBlock, [80, 3, 1]], #6 cat 4
   [-1, 1, RepVGGBlock, [192, 3, 2]], #7 5-P4/16
   [-1, 1, RepVGGBlock, [176, 3, 1]], #8
   [-1, 1, RepVGGBlock, [176, 3, 1]], #9
   [-1, 1, RepVGGBlock, [176, 3, 1]], #10 CAT 6
   [-1, 1, RepVGGBlock, [512, 3, 2]], #11 7-P4/16
   [-1, 1, SPPF, [512, 5]], #12
  ]
# YOLOv5 head
head:
  [[-1, 1, GSConv, [256, 1, 1]], #13
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], #14
   [[-1, 10], 1, Concat, [1]],  #15 cat backbone P4
   [-1, 2, C2fCA, [256, False]],  # 16

   [-1, 1, GSConv, [128, 1, 1]], #17
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], #18
   [[-1, 6], 1, Concat, [1]],  #19 cat backbone P3
   [-1, 2, C2fCA, [128, False]],  #20  (P3/8-small)

   [-1, 1, GSConv, [128, 3, 2]], #21
   [[-1, 16], 1, Concat, [1]],  #22 cat head P4
   [-1, 2, C2fCA, [128, False]],  # 23 (P4/16-medium)

   [-1, 1, GSConv, [256, 3, 2]], #24
   [[-1, 12], 1, Concat, [1]],  #25 cat head P5
   [-1, 2, C2fCA, [512, False]],  # 26 (P5/32-large)

   [[20, 23, 26], 1, Detect, [nc, anchors]],  #27 Detect(P3, P4, P5)
  ]
